# Pandas 기초연습문제

In [2]:
import pandas as pd
# 판다스 모듈을 불러온다

#### 1. 딕셔너리를 이용하여 아래와 같은 모양이 되도록 data frame을 생성하시오.

In [3]:
score={'학번':[201524213,201621223,201621233, 201611111, 201722222],
       '이름':['오지환','박용택','정성훈', '다니엘', '지민'],
       '학과':['경영정보','경영정보','경영정보','컴퓨터공학','컴퓨터공학'],
       'Quiz':[15,20,10,17,18],
       '중간고사':[20,20,15,18,16]}
# 학생에 대한 정보를 key 그에 대한 실제 값을 value 로하는 딕셔너리 생성


df = pd.DataFrame(score)
df

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
2  201621233  정성훈   경영정보    10    15
3  201611111  다니엘  컴퓨터공학    17    18
4  201722222   지민  컴퓨터공학    18    16

In [4]:
df['학번']
# 학번 이라는 변수의 value만을 출력한다

0    201524213
1    201621223
2    201621233
3    201611111
4    201722222
Name: 학번, dtype: int64

#### 2. 위에서 생성한 데이터프레임으로부터 인덱싱을 이용하여 이름과 중간고사를 추출하시오.

In [6]:
df[['이름','중간고사']]
# '이름' 과 '중간고사' 변수에 대한 데이터를 하나로 묶어서 출력해야 하므로, 
# 두 변수가 동시에 묶인 변수를 한번 더 []에 의해 묶어서 출력해준다.

    이름  중간고사
0  오지환    20
1  박용택    20
2  정성훈    15
3  다니엘    18
4   지민    16

#### 3. reindex를 이용하여 2, 0, 4, 1, 3 순으로 순서를 변경하시오.

In [7]:
df = df.reindex([2,0,4,1,3])
df 

# reindex라는 판다스의 메소드를 이용해서 현재 데이터 프레임인 df의 index순서를
# 2,0,4,1,3 의 순서로 출력한다

          학번   이름     학과  Quiz  중간고사
2  201621233  정성훈   경영정보    10    15
0  201524213  오지환   경영정보    15    20
4  201722222   지민  컴퓨터공학    18    16
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18

#### 4. iloc과 loc을 각각 이용하여 박용택 학생의 record를 추출하시오. (iloc으로 한번, loc으로 한번 수행)

In [9]:
print(df.iloc[3])
# 박용택은 4번째 행에 record가 존재하므로, 데이터 프레임의 행을 추출하는 메소드인
# iloc를 사용하여, 4번째 record를 추출한다

print(df.loc[1])
# 박용택 record의 인덱스는 1이므로, 인덱스정보로 record를 추출할 수 있는 
# loc 메소드를 사용하여 박용택의 record를 추출할 수 있다.

학번      201621223
이름            박용택
학과           경영정보
Quiz           20
중간고사           20
Name: 1, dtype: object
학번      201621223
이름            박용택
학과           경영정보
Quiz           20
중간고사           20
Name: 1, dtype: object

#### 5. iloc과 loc을 각각 이용하여 모든 학생의 이름과 중간고사 점수를 추출하시오. (iloc으로 한번, loc으로 한번 수행)

In [10]:
print(df.iloc[:, [1, 4]])
# 1열과 4열의 모든 데이터를 추출한다.

print(df.loc[:, ['이름', '중간고사']])
# '이름'과 '중간고사' 변수의 데이터를 추출한다.

    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18
    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18

#### 6. 중간고사 점수의 평균을 구하시오

In [12]:
df['중간고사'].mean()
# 중간고사 변수의 모든 데이터에 대한 평균값을 출력한다

17.8

#### 7. 중간고사 점수가 가장 낮은 학생의 index를 구하시오.

In [13]:
df['중간고사'].idxmin()
# idxmin() 을 이용해 변수의 데이터의 최소값을 구한다

2

#### 8. 퀴즈 점수가 가장 높은 학생의 학번을 구하시오.

In [14]:
df.loc[df['Quiz'].idxmax(), '학번']
# loc 메소드로 인덱스를 이용하여 Quiz 열의 가장 큰 데이터 값을 행으로 하고, 
# 그에 대한 학번의 데이터 값을 출력한다

201621223

#### 9. 위 데이터프레임의 각 열에 대해서 개수, 평균, 표준편차, 최소최대값 등의 다양한 통계량을 출력하시오.

In [15]:
df.describe()
# 데이터프레임의 모든 변수에 대하여 다양한 통계량을 출력할 수 있다.

                 학번       Quiz       중간고사
count  5.000000e+00   5.000000   5.000000
mean   2.016200e+08  16.000000  17.800000
std    7.018995e+04   3.807887   2.280351
min    2.015242e+08  10.000000  15.000000
25%    2.016111e+08  15.000000  16.000000
50%    2.016212e+08  17.000000  18.000000
75%    2.016212e+08  18.000000  20.000000
max    2.017222e+08  20.000000  20.000000

#### 10. 위 데이터프레임을 중간고사 점수에 따라 내림차순으로 정렬하시오.

In [16]:
df.sort_values('중간고사', ascending=False)
# sort_values 메소드에 정렬의 기준이 되는 변수를 설정하고, 
# ascending 을 True로 설정하면 정렬 기준이 되는 변수의 값에 대하여 오름차순
# ascending 을 False로 설정하면 내림차순으로 정렬하여 데이터프레임을 반환한다.

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18
4  201722222   지민  컴퓨터공학    18    16
2  201621233  정성훈   경영정보    10    15

#### 11. 학생 중에서 퀴즈 점수가 평균 이상인 학생들의 이름을 출력하시오.

In [17]:
quiz_mean = df['Quiz'].mean()
df[df['Quiz'] > quiz_mean]['이름']
# df의 Quiz 변수에 대하여 Quiz의 평균 값보다 큰 값을 가지는 점수를 행으로 하는 
# 모든 Record를 추출한 데이터 프레임의 '이름' 변수만을 출력한 데이터프레임이 출력된다.

4     지민
1    박용택
3    다니엘
Name: 이름, dtype: object

#### 12. 학생 중에서 퀴즈와 중간고사 점수 모두 평균 이상인 학생들의 record를 출력하시오.

In [21]:
mid_mean = df['중간고사'].mean()


df[(df['Quiz'] > quiz_mean) & (df['중간고사'] >  mid_mean)]

# Quiz 값의 평균 값보다 큰 데이터 프레임의 집합과
# 중간고사 값의 평균 값보다 큰 데이터 프레임의 집합의 공통 분모인 Record로 이루어진
# 데이터 프레임을 출력한다.

          학번   이름     학과  Quiz  중간고사
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18

#### 13. value_counts를 이용하여 학과 별로 학생의 수를 구하시오.

In [22]:
df['학과'].value_counts()
# value_counts() 메소드는 각 변수의 데이터별로 값의 빈도를 출력해주는 메소드이다.

경영정보     3
컴퓨터공학    2
Name: 학과, dtype: int64

#### 14. groupby를 이용하여 학과 별로 중간고사의 평균을 구하시오.

In [23]:
df.groupby('학과')['중간고사'].mean()

# 데이터 프레임을 학과 별로 순서대로 나열한 데이터 프레임의 형태로 바구꼬
# 그 데이터 프레임의 '중간고사' 변수만을 출력하여 그에 대한 각각의 평균값을 출력한다.

학과
경영정보     18.333333
컴퓨터공학    17.000000
Name: 중간고사, dtype: float64

In [25]:
df.mean()

# mean은 데이터 프레임에 적용하면,
# 데이터프레임의 모든 변수에 대한 평균 값을 출력하는 메소드로 작용한다

학번      201620000.4
Quiz           16.0
중간고사           17.8
dtype: float64

In [32]:
list(df.groupby('학과'))
# 학과 별로 그룹화 되어진 데이터 프레임을 리스트화 시킨다.

[('경영정보',
            학번   이름    학과  Quiz  중간고사
  2  201621233  정성훈  경영정보    10    15
  0  201524213  오지환  경영정보    15    20
  1  201621223  박용택  경영정보    20    20),
 ('컴퓨터공학',
            학번   이름     학과  Quiz  중간고사
  4  201722222   지민  컴퓨터공학    18    16
  3  201611111  다니엘  컴퓨터공학    17    18)]